_posts_bak/2021-12-30-boj-15681.html
---
layout: post
title: BOJ 15681 트리와 쿼리
tags: DP Tree
---

<div id="outline-container-orgc563799" class="outline-2">
<h2 id="orgc563799">BOJ 15681</h2>
<div class="outline-text-2" id="text-orgc563799">
<ul class="org-ul">
<li>정점 U를 root로 하는 sub tree에 속한 정점 수 구하기</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa8b87f" class="outline-2">
<h2 id="orgfa8b87f">접근하기</h2>
<div class="outline-text-2" id="text-orgfa8b87f">
<ul class="org-ul">
<li>트리에 DP를 적용해서 풀기</li>
<li>dfs로 tree를 탐색하면서, dp 배열의 값을 점화 규칙에 맞게 채운다.</li>
</ul>

<pre class="example">
           5
         /   \
        4      6
        |    / | \
        3   7  8  9
       / \
      1   2

U-&gt;5, 9
U-&gt;4, 4
U-&gt;9, 1

tree의 모든 정점에 대해서
dp[parent] = dp[parent] + dfs(child)
</pre>
</div>
</div>

<div id="outline-container-orgab1b35c" class="outline-2">
<h2 id="orgab1b35c">코드</h2>
<div class="outline-text-2" id="text-orgab1b35c">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">R</span>, <span style="color: #ff6347;">Q</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">U</span>;
<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">G</span>[100010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[100010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">visit</span>[100010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (visit[num]) <span style="color: #729fcf; font-weight: bold;">return</span> dp[num];
    visit[num] = 1;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">next</span>:G[num]) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (visit[next] == 0) {
            dp[num] = dp[num] + dfs(next);  
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> dp[num];
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    freopen(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;N, &amp;R, &amp;Q);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-1;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;p1, &amp;p2);
        G[p1].push_back(p2);
        G[p2].push_back(p1);
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        dp[i] = 1;
    }

    dfs(R);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;Q;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;U); 
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, dp[U]);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org48bbd75" class="outline-2">
<h2 id="org48bbd75">문제 링크</h2>
<div class="outline-text-2" id="text-org48bbd75">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/15681">https://www.acmicpc.net/problem/15681</a></li>
</ul>
</div>
</div>

<div id="outline-container-org748e02a" class="outline-2">
<h2 id="org748e02a">참고자료</h2>
<div class="outline-text-2" id="text-org748e02a">
<ul class="org-ul">
<li><a href="https://codeforces.com/blog/entry/20935">DP on Trees Tutorial</a></li>
<li><a href="https://justicehui.github.io/hard-algorithm/2019/01/18/treeDP/">https://justicehui.github.io/hard-algorithm/2019/01/18/treeDP/</a></li>
<li><a href="https://chanhuiseok.github.io/posts/algo-56/">https://chanhuiseok.github.io/posts/algo-56/</a></li>
</ul>
</div>
</div>
